<style>
  body {
    font-family: consolas;
  }
</style>
<h2>印出菱形排列的星星</h2>
<?php
/*
利用巢狀迴圈來產生菱形排列的星星
需要先決定一個參數
  可能是最寬處的星星個數或列數
  也可能是總列數
然後再去推算需要列數(外層)
及星星數(內層)

本例以最寬處的列數來做範例
將程式拆成兩個迴圈來執行
  ->第一個迴圈執行列印到最寬處理的正三角形
  ->第二個迴圈執行列印到最後的倒三角形
*/

//第一個迴圈執行正三角形的列印
for($i=1;$i<=5;$i++){
  for($k=1;$k<(6-$i);$k++){
    echo "&nbsp;";
  }
  for($j=1;$j<=(2*$i-1);$j++){
    echo "*";
  }
  echo "<br>";
}

//第二個迴圈執行倒三角形的列印
for($i=4;$i>0;$i--){
  for($k=1;$k<=(5-$i);$k++){
    echo "&nbsp;";
  }
  for($j=1;$j<=(2*$i-1);$j++){
    echo "*";
  }
  echo "<br>";
}

echo "<br>";
?>

<h2>印出菱形排列的星星-簡化版</h2>
<?php

//利用一個暫存變數來簡化的做法:
//原理是利用判斷式來決定要印是正三角形還是倒三角形

//暫用的變數temp，用來計算當前列數要印的星星及空白個數
$temp=0;
for($i=1;$i<=9;$i++){

  //根據列數來決定暫存變數的值
  if($i>5){
    $temp=$temp-1;
  }else{
    $temp=$i;
  }

  //根據暫存變數的值來決定要列印的空白及星星個數
  for($j=1;$j<=(4+$temp);$j++){
    if($j<=(5-$temp)){
      echo "&nbsp;";
    }else{
      echo "*";
    }
  }
  echo "<br>";
}
?>