<style>
body{
  font-family:consolas;
}
</style>
<h2>印出正三角形排列的星星</h2>
<?php
/*
  利用巢狀迴圈來產生一個正三角形的星星排列
  每一列會增加2顆星星
  每列會利用空白來做排列
  星星數為(列數*2+1)
  空白數為(列數-列號)
*/

//外層迴圈用來決定列數
for($i=1;$i<=5;$i++){

  //內層迴圈用來決定空白和星星的個數
  //每一行的空白數是逐行少1，因此用列數減掉外層的$i來得到要列印的空白個數
  for($k=1;$k<(6-$i);$k++){

    echo "&nbsp;";

  }

  //每一行的星星數是列數*2+1
  for($j=1;$j<=(2*$i-1);$j++){

    echo "*";

  }
  
  echo "<br>";
}

?>

<h2>印出正三角形排列的星星-簡化版</h2>
<?php
/*
由於內層不是印空白就是印星星，
因此可以把上面的程式再做簡化
利用判斷式來決定要印的是星星還是空白

*/
for($i=1;$i<=5;$i++){

  for($j=1;$j<=(4+$i);$j++){

    if($j<=(5-$i)){
      echo "&nbsp;";
    }else{
      echo "*";
    }

  }
  echo "<br>";
}

?>